{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "Authenticity Bias",
    "1": "Comparative Lens",
    "2": "Disposition Bias",
    "3": "Expectation Bias",
    "4": "Moral or Political Projection",
    "5": "Omission Focus",
    "6": "Performance Appraisal",
    "7": "Representation Critique",
    "8": "Selective Emphasis Bias"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "Authenticity Bias": 0,
    "Comparative Lens": 1,
    "Disposition Bias": 2,
    "Expectation Bias": 3,
    "Moral or Political Projection": 4,
    "Omission Focus": 5,
    "Performance Appraisal": 6,
    "Representation Critique": 7,
    "Selective Emphasis Bias": 8
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "single_label_classification",
  "tie_word_embeddings": true,
  "transformers_version": "5.0.0",
  "type_vocab_size": 2,
  "use_cache": false,
  "vocab_size": 30522
}
